app/controllers/users_controller.rb

	def index
		@books = Book.paginate(:page => params[:page],:per_page => 10)
---
SELECT COUNT(*) FROM `books`
SELECT `books`.* FROM `books` LIMIT 2 OFFSET 0

	def create
		user = User.create(params[:user])
---
INSERT INTO `users` (`created_at`, `title`, `updated_at`) VALUES ('2012-06-18 16:41:23', NULL, '2012-06-18 16:41:23')

	def like
		book = Book.find(params[:id])
		like  = book.likes.create(:user_id=>session[:user_id]) if session[:user_id]
			count = book.choosed
			book.choosed = count+1
			book.save
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
INSERT INTO `likes` (`book_id`, `created_at`, `is_like`, `updated_at`, `user_id`) VALUES (NULL, '2012-06-19 19:12:31', 0, '2012-06-19 19:12:31', 17)
UPDATE `books` SET `updated_at` = '2012-06-19 20:32:08', `choosed` = 1 WHERE `books`.`id` = 5